# Next Round

## Описание задачи
Участник выходит в следующий раунд соревнований, если он набрал не меньше баллов, чем участник, занявший k-е место, при условии, что набранное им число баллов строго положительно.

Вам даны количество участников `n` и позиция `k`, а также список их баллов в порядке невозрастания. Нужно определить, сколько участников пройдет в следующий раунд.

## Входные данные
- В первой строке даны два целых числа `n` и `k` (`1 ≤ k ≤ n ≤ 50`).
- Во второй строке содержится `n` целых чисел `a1, a2, ..., an` (`0 ≤ ai ≤ 100`), отсортированных по убыванию.

## Выходные данные
Выведите одно целое число — количество участников, которые проходят в следующий раунд.


## Примеры
### Входные данные 1
```
8 5
10 9 8 7 7 7 5 5
```
### Выходные данные 1
```
6
```

### Входные данные 2
```
4 2
0 0 0 0
```
### Выходные данные 2
```
0
```
[Solution](Main.java)


<details>
  <summary>Показать код</summary>

```java
import java.util.Scanner;
public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int k = sc.nextInt();
        int[] scores = new int[n];

        for (int i = 0; i < n; i++) {
            scores[i] = sc.nextInt();
        }

        int count = 0;
        int minScore = scores[k - 1];

        for (int score : scores) {
            if (score >= minScore && score > 0) {
                count++;
            }
        }

        System.out.println(count);
        sc.close();
    }
}
```

</details>


## Пояснение 
1. В первом примере участник, занявший `k`-е место, набрал 7 баллов. Все участники с таким же или большим количеством баллов проходят. В итоге в следующий раунд выходят 6 участников.
2. Во втором примере никто не набрал положительного количества баллов, поэтому в следующий раунд никто не проходит.


